RSN/src/InformationRegisters/RJM_ЛогОшибок/RJM_ЛогОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RJM_ЛогОшибок</name>
  <resources>
    <name>ИнформацияОбОшибкеИлиОСостоянии</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВебСервис</name>
    <type>
      <types>CatalogRef.RJM_ВебСервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СобытиеПроверки</name>
    <type>
      <types>EnumRef.RJM_СобытиеПроверки</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/RJM_СобытиеПроверки/RJM_СобытиеПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RJM_СобытиеПроверки</name>
  <enumValues>
    <name>ПроверкаНаВыполнение</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНаОшибку</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНаНеИспользование</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Catalogs/RJM_ВебСервисы/RJM_ВебСервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_ВебСервисы</name>
  <attributes>
    <name>АдресВебСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/Catalogs/RJM_РегламентныеЗаданияДляПроверки/RJM_РегламентныеЗаданияДляПроверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_РегламентныеЗаданияДляПроверки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВебСервис</name>
    <type>
      <types>CatalogRef.RJM_ВебСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтслеживатьЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПроверки</name>
    <type>
      <types>EnumRef.RJM_СобытиеПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СобытияПроверки</name>
    <attributes>
      <name>СобытиеПроверки</name>
      <type>
        <types>EnumRef.RJM_СобытиеПроверки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/RJM_АдресаРассылки/RJM_АдресаРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_АдресаРассылки</name>
  <tabularSections>
    <name>ПодписанныеРегламентныеЗадания</name>
    <attributes>
      <name>РегламентноеЗадание</name>
      <type>
        <types>CatalogRef.RJM_РегламентныеЗаданияДляПроверки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/Catalogs/RJM_НастройкаЭлектронногоАдресаСервера/RJM_НастройкаЭлектронногоАдресаСервера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RJM_НастройкаЭлектронногоАдресаСервера</name>
  <attributes>
    <name>НастройкаПочты</name>
    <type>
      <types>CatalogRef.RJM_НастройкаПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>SMPTАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинSMTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПодсистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТекста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RSN/src/CommonModules/RJM_ОбщийМодуль/Module.bsl
Процедура RJM_ОбновитьСправочникРеглЗаданияНаПроверку(ЭлементМассива, СписокОшибок) Экспорт
	
	ЭлСправочника = Справочники.RJM_ВебСервисы.НайтиПоНаименованию(ЭлементМассива);
	ОписаниеОшибкиПодключения = "";
	ПроксиСоединение = ПолучитьПроксиСоединение(ЭлСправочника.АдресВебСервиса, ЭлСправочника.ИмяПользователя, ЭлСправочника.Пароль, ОписаниеОшибкиПодключения);
	Если ПроксиСоединение = Неопределено Тогда
		СписокОшибок.Добавить(ОписаниеОшибкиПодключения);
		Возврат;
	КонецЕсли;
	
	ПакетXDTO = ПроксиСоединение.GetInformationAboutRegulatedJob();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	RJM_РегламентныеЗаданияДляПроверки.Ссылка
	|ИЗ
	|	Справочник.RJM_РегламентныеЗаданияДляПроверки КАК RJM_РегламентныеЗаданияДляПроверки
	|ГДЕ
	|	RJM_РегламентныеЗаданияДляПроверки.ЭтоГруппа = &ЭтоГруппа
	|	И RJM_РегламентныеЗаданияДляПроверки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", ЭлСправочника.Наименование);
	Запрос.УстановитьПараметр("ЭтоГруппа", Истина);
	РезПоискаГруппы = Запрос.Выполнить();
	
	Если Не РезПоискаГруппы.Пустой() Тогда
		Выборка = РезПоискаГруппы.Выбрать();
		Выборка.Следующий();
		ГруппаЭлемента = Выборка.Ссылка;
	Иначе
		ГруппаЭлемента = Справочники.RJM_РегламентныеЗаданияДляПроверки.СоздатьГруппу();
		ГруппаЭлемента.Наименование = ЭлСправочника.Наименование;
		ГруппаЭлемента.Записать();
	КонецЕсли;
	
	Для каждого стр из ПакетXDTO.STRINGHEAD Цикл			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	RJM_РегламентныеЗаданияДляПроверки.Ссылка
		|ИЗ
		|	Справочник.RJM_РегламентныеЗаданияДляПроверки КАК RJM_РегламентныеЗаданияДляПроверки
		|ГДЕ
		|	RJM_РегламентныеЗаданияДляПроверки.ВебСервис = &ВебСервис
		|	И RJM_РегламентныеЗаданияДляПроверки.УникальныйИдентификатор = &УникальныйИдентификатор";
		Запрос.УстановитьПараметр("ВебСервис", ЭлСправочника.Ссылка);
		Запрос.УстановитьПараметр("УникальныйИдентификатор", Новый УникальныйИдентификатор(стр.УникальныйИдентификатор));
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ТекЭлемент = Справочники.RJM_РегламентныеЗаданияДляПроверки.СоздатьЭлемент();	
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ТекЭлемент = Выборка.Ссылка.ПолучитьОбъект();;
		КонецЕсли;
		ТекЭлемент.Родитель = ГруппаЭлемента.Ссылка;
		ТекЭлемент.Наименование = стр.МетаданныеИмя;
		ТекЭлемент.ВебСервис = ЭлСправочника.Ссылка;
		ТекЭлемент.Использование = стр.Использование;
		ТекЭлемент.УникальныйИдентификатор = Новый УникальныйИдентификатор(стр.УникальныйИдентификатор);
		ТекЭлемент.Записать();			
	КонецЦикла;		
	
КонецПроцедуры

#Область РегламетныеПроцедурыИФункции

Процедура RJM_ПроверкаРегламентныхЗаданий() Экспорт
	
	Если ОсновнойЭлектронныйАдресСервераНастроен() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ВебСервис КАК ВебСервис,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ВебСервис.АдресВебСервиса КАК АдресВебСервиса,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ВебСервис.ИмяПользователя КАК ИмяПользователя,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ВебСервис.Пароль КАК Пароль,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.Наименование КАК РегламентноеЗадание,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.СобытиеПроверки КАК СобытиеПроверки
		|ИЗ
		|	Справочник.RJM_РегламентныеЗаданияДляПроверки.СобытияПроверки КАК RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки
		|ГДЕ
		|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ОтслеживатьЗадание = &ОтслеживатьЗадание";
		Запрос.УстановитьПараметр("ОтслеживатьЗадание", Истина);
		РезультатЗапроса = Запрос.Выполнить();
		
		СтарыйАдресВебСервиса = "";
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если СтарыйАдресВебСервиса <> Выборка.АдресВебСервиса Тогда
					ПроксиСоединение = RJM_ОбщийМодуль.ПолучитьПроксиСоединение(Выборка.АдресВебСервиса, Выборка.ИмяПользователя, Выборка.Пароль);
					СтарыйАдресВебСервиса = Выборка.АдресВебСервиса;
				КонецЕсли;
				ПакетXDTO = ПроксиСоединение.GetInformationAboutRegulatedJobByKey(Строка(Выборка.УникальныйИдентификатор));
				Для каждого стр из ПакетXDTO.STRINGHEAD Цикл
					Если Выборка.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаНеИспользование Тогда
						Если стр.Использование = Ложь Тогда
							МенеджерЗаписи = РегистрыСведений.RJM_ЛогОшибок.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
							МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
							МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаНеИспользование; 
							МенеджерЗаписи.Прочитать();
							Если Не МенеджерЗаписи.Выбран() Тогда
								МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
								МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;	
								МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаНеИспользование; 
								МенеджерЗаписи.ИнформацияОбОшибкеИлиОСостоянии = "Не используется";
								МенеджерЗаписи.СостояниеЗадания = стр.СостояниеЗадания;
								МенеджерЗаписи.РегламентноеЗадание = Выборка.РегламентноеЗадание;
								МенеджерЗаписи.Записать();
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли Выборка.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаВыполнение Тогда
						Если Найти(ВРег(СокрЛП(стр.СостояниеЗадания)),"ВЫПОЛНЕНО") > 0 Тогда
							МенеджерЗаписи = РегистрыСведений.RJM_ЛогОшибок.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
							МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
							МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаВыполнение; 
							МенеджерЗаписи.Прочитать();
							Если Не МенеджерЗаписи.Выбран() Тогда
								МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
								МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;	
								МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаВыполнение; 
								МенеджерЗаписи.ИнформацияОбОшибкеИлиОСостоянии = "Выполнено";
								МенеджерЗаписи.СостояниеЗадания = стр.СостояниеЗадания;
								МенеджерЗаписи.РегламентноеЗадание = Выборка.РегламентноеЗадание;
								МенеджерЗаписи.Записать();
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли Выборка.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаОшибку Тогда
						Если стр.ИнформацияОбОшибке <> "" Тогда
							МенеджерЗаписи = РегистрыСведений.RJM_ЛогОшибок.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
							МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
							МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаОшибку; 
							МенеджерЗаписи.Прочитать();
							Если Не МенеджерЗаписи.Выбран() Тогда
								МенеджерЗаписи.ВебСервис = Выборка.ВебСервис;
								МенеджерЗаписи.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;	
								МенеджерЗаписи.СобытиеПроверки = Перечисления.RJM_СобытиеПроверки.ПроверкаНаОшибку; 
								МенеджерЗаписи.ИнформацияОбОшибкеИлиОСостоянии = стр.ИнформацияОбОшибке;
								МенеджерЗаписи.СостояниеЗадания = стр.СостояниеЗадания;
								МенеджерЗаписи.РегламентноеЗадание = Выборка.РегламентноеЗадание;
								МенеджерЗаписи.Записать();
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ВыполнитьРассылкуОповещений();	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРассылкуОповещений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка,
	|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.СобытиеПроверки
	|ПОМЕСТИТЬ ВТРегламентныеЗаданияНаПроверку
	|ИЗ
	|	Справочник.RJM_РегламентныеЗаданияДляПроверки.СобытияПроверки КАК RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки
	|ГДЕ
	|	RJM_РегламентныеЗаданияДляПроверкиСобытияПроверки.Ссылка.ОтслеживатьЗадание = &ОтслеживатьЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	RJM_АдресаРассылкиПодписанныеРегламентныеЗадания.РегламентноеЗадание КАК РегламентноеЗадание,
	|	RJM_АдресаРассылкиПодписанныеРегламентныеЗадания.Ссылка.Наименование КАК НаименованиеАдреса
	|ПОМЕСТИТЬ ВТАдресаИРегламетныеЗадания
	|ИЗ
	|	Справочник.RJM_АдресаРассылки.ПодписанныеРегламентныеЗадания КАК RJM_АдресаРассылкиПодписанныеРегламентныеЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРегламентныеЗаданияНаПроверку.Ссылка КАК РегламентноеЗадание,
	|	ВТРегламентныеЗаданияНаПроверку.Ссылка.ВебСервис КАК ВебСервис,
	|	ВТРегламентныеЗаданияНаПроверку.Ссылка.УникальныйИдентификатор КАК УникальныйИдентификатор,
	|	ВТРегламентныеЗаданияНаПроверку.СобытиеПроверки,
	|	ВТАдресаИРегламетныеЗадания.НаименованиеАдреса
	|ПОМЕСТИТЬ ВТЗаданияИПодписчики
	|ИЗ
	|	ВТРегламентныеЗаданияНаПроверку КАК ВТРегламентныеЗаданияНаПроверку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАдресаИРегламетныеЗадания КАК ВТАдресаИРегламетныеЗадания
	|		ПО (ВТАдресаИРегламетныеЗадания.РегламентноеЗадание = ВТРегламентныеЗаданияНаПроверку.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаданияИПодписчики.НаименованиеАдреса КАК НаименованиеПолучателя,
	|	RJM_ЛогОшибок.ИнформацияОбОшибкеИлиОСостоянии,
	|	RJM_ЛогОшибок.СостояниеЗадания,
	|	RJM_ЛогОшибок.РегламентноеЗадание,
	|	RJM_ЛогОшибок.ВебСервис
	|ИЗ
	|	ВТЗаданияИПодписчики КАК ВТЗаданияИПодписчики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.RJM_ЛогОшибок КАК RJM_ЛогОшибок
	|		ПО ВТЗаданияИПодписчики.ВебСервис = RJM_ЛогОшибок.ВебСервис
	|			И ВТЗаданияИПодписчики.СобытиеПроверки = RJM_ЛогОшибок.СобытиеПроверки
	|			И ВТЗаданияИПодписчики.УникальныйИдентификатор = RJM_ЛогОшибок.УникальныйИдентификатор";
	Запрос.УстановитьПараметр("ОтслеживатьЗадание", Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	НаименованиеОтправителя = "";
	ШаблонТемы = "";
	ШаблонТекста = "";
	ИмяОтправителя = "";
	НоваяИнтернетПочта = Новый ИнтернетПочта;	
	Попытка
		НоваяИнтернетПочта.Подключиться(НовыйПрофильИнтернетПочты(НаименованиеОтправителя, ШаблонТемы, ШаблонТекста, ИмяОтправителя));	
	Исключение
		СформироватьОшибкуПроверкиОсновногоЭлектронногоАдресаСервера("Ошибка подключения к электронному адресу сервера", ОписаниеОшибки());
		ВызватьИсключение("Произошла ошибка, проверьте лог ошибок");
		Возврат;
	КонецПопытки;
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
				
		Пока Выборка.Следующий() Цикл
			НоваяИнтернетПочта.Послать(НовоеИнтернетПочтовоеСообщение(НаименованиеОтправителя, Выборка.НаименованиеПолучателя, Выборка.ВебСервис.Наименование, 
			Выборка.РегламентноеЗадание, Выборка.ИнформацияОбОшибкеИлиОСостоянии, Выборка.СостояниеЗадания, ШаблонТемы, ШаблонТекста, ИмяОтправителя));
		КонецЦикла;
		
		НоваяИнтернетПочта.Отключиться();
		
		// чистим лог
		РегистрыСведений.RJM_ЛогОшибок.СоздатьНаборЗаписей().Записать();
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции
Функция СоединениеСПочтойУстановлено(ТекстОписаниеОшибки = "") Экспорт 
	
	НоваяИнтернетПочта = Новый ИнтернетПочта;
	ИнтернетПрофиль = НовыйПрофильИнтернетПочты();
	Попытка
		НоваяИнтернетПочта.Подключиться(ИнтернетПрофиль);
		НоваяИнтернетПочта.Отключиться();
		Возврат Истина;
	Исключение
		ТекстОписаниеОшибки = "Ошибка подключения " + ОписаниеОшибки();
		Возврат Ложь;		
	КонецПопытки;
	
КонецФункции

Функция НовыйПрофильИнтернетПочты(НаименованиеОтправителя = "", ШаблонТемы = "", ШаблонТекста = "", ИмяОтправителя = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	RJM_НастройкаЭлектронногоАдресаСервера.Наименование,
	|	RJM_НастройкаЭлектронногоАдресаСервера.НастройкаПочты,
	|	RJM_НастройкаЭлектронногоАдресаСервера.SMPTАутентификация,
	|	RJM_НастройкаЭлектронногоАдресаСервера.ЛогинSMTP,
	|	RJM_НастройкаЭлектронногоАдресаСервера.ПарольSMTP,
	|	RJM_НастройкаЭлектронногоАдресаСервера.ШаблонТемы,
	|	RJM_НастройкаЭлектронногоАдресаСервера.ШаблонТекста,
	|	RJM_НастройкаЭлектронногоАдресаСервера.ИмяОтправителя
	|ИЗ
	|	Справочник.RJM_НастройкаЭлектронногоАдресаСервера КАК RJM_НастройкаЭлектронногоАдресаСервера
	|ГДЕ
	|	RJM_НастройкаЭлектронногоАдресаСервера.ПочтаПодсистемы = &ПочтаПодсистемы";
	Запрос.УстановитьПараметр("ПочтаПодсистемы", Истина);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Выборка.Следующий();
		НастройкаПочты = Выборка.НастройкаПочты;
		НаименованиеОтправителя = Выборка.Наименование;
		ШаблонТемы = Выборка.ШаблонТемы;
		ШаблонТекста = Выборка.ШаблонТекста;
		ИмяОтправителя = Выборка.ИмяОтправителя;
		
		ИнтернетПрофильПочты = Новый ИнтернетПочтовыйПрофиль;
		ИнтернетПрофильПочты.АдресСервераSMTP = НастройкаПочты.SMTPСервер;
		Если НастройкаПочты.ВремяОжиданияСервера > 0 Тогда
			ИнтернетПрофильПочты.ВремяОжиданияСервера = НастройкаПочты.ВремяОжиданияСервера;
		КонецЕсли;
		
		ИнтернетПрофильПочты.ПортSMTP = НастройкаПочты.ПортSMTP;
		ИнтернетПрофильПочты.ИспользоватьSSLSMTP = НастройкаПочты.ИспользоватьSSL;
		
		Если Выборка.SMPTАутентификация Тогда
			ИнтернетПрофильПочты.ПарольSMTP = Выборка.ПарольSMTP;
			ИнтернетПрофильПочты.ПользовательSMTP = Выборка.ЛогинSMTP;
		КонецЕсли;	
		
		Возврат ИнтернетПрофильПочты;
		
	Иначе
		Сообщить("Был создан пустой почтовый профиль, так как не найдена основная почта подсистемы.");
		Возврат Новый ИнтернетПочтовыйПрофиль;
	КонецЕсли;
	
КонецФункции 

Функция НовоеИнтернетПочтовоеСообщение(НаименованиеОтправителя, НаименованиеПолучателя, ВебСервисНаименование, РегламетноеЗадание, ПодробноеОписаниеОшибки, СостояниеЗаданияВданныйМомент, ШаблонТемы, ШаблонТекста, ИмяОтправителя)
	
	ШаблонТемыИзмененный = СтрЗаменить(ШаблонТемы, "[ВебСервисНаименование]", ВебСервисНаименование); 
	ШаблонТемыИзмененный = СтрЗаменить(ШаблонТемыИзмененный, "[РегламентноеЗадание]", РегламетноеЗадание); 
	ШаблонТемыИзмененный = СтрЗаменить(ШаблонТемыИзмененный, "[ПодробноеОписаниеОшибки]", ПодробноеОписаниеОшибки); 
	ШаблонТемыИзмененный = СтрЗаменить(ШаблонТемыИзмененный, "[СостояниеЗаданияВДанныйМомент]", СостояниеЗаданияВданныйМомент); 
	
	ШаблонТекстаИзмененный = СтрЗаменить(ШаблонТекста, "[ВебСервисНаименование]", ВебСервисНаименование); 
	ШаблонТекстаИзмененный = СтрЗаменить(ШаблонТекстаИзмененный, "[РегламетноеЗадание]", РегламетноеЗадание); 
	ШаблонТекстаИзмененный = СтрЗаменить(ШаблонТекстаИзмененный, "[ПодробноеОписаниеОшибки]", ПодробноеОписаниеОшибки); 
	ШаблонТекстаИзмененный = СтрЗаменить(ШаблонТекстаИзмененный, "[СостояниеЗаданияВДанныйМомент]", СостояниеЗаданияВданныйМомент); 	
	
	НовоеИнтернетПочтовоеСообщение = Новый ИнтернетПочтовоеСообщение;
	НовоеИнтернетПочтовоеСообщение.Получатели.Добавить(НаименованиеПолучателя);
	НовоеИнтернетПочтовоеСообщение.Тема = ШаблонТемыИзмененный;
	НовоеИнтернетПочтовоеСообщение.ИмяОтправителя = ИмяОтправителя;
	НовоеИнтернетПочтовоеСообщение.Отправитель = НаименованиеОтправителя;
	НовоеИнтернетПочтовоеСообщение.Тексты.Добавить(ШаблонТекстаИзмененный, ТипТекстаПочтовогоСообщения.ПростойТекст);											
	Возврат НовоеИнтернетПочтовоеСообщение;		
	
КонецФункции

Функция ПолучитьПроксиСоединение(АдресВебСервиса, Имя, Пароль, ОписаниеОшибкиПодключения = "") Экспорт
	Попытка
		Определения = Новый WSОпределения(АдресВебСервиса + "?wsdl", Имя, Пароль);
		Прокси = Новый WSПрокси(Определения, Определения.Сервисы.Получить(0).URIПространстваИмен, Определения.Сервисы.Получить(0).Имя, Определения.Сервисы.Получить(0).Имя+"Soap");
		Прокси.Пользователь = Имя;
		Прокси.Пароль = Пароль;
		Возврат Прокси;	
	Исключение
		ОписаниеОшибкиПодключения = "Прокси соединение не создано, описание ошибки: " + ОписаниеОшибки();
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ОсновнойЭлектронныйАдресСервераНастроен()
	
	РезультатПроверки = Истина;
	СобытиеОшибки = "Системная ошибка установки основной почты сервера";
	СообщениеОбОшибке = "Системная ошибка установки основной почты сервера, пожалуйста настройте основную запись почты сервера в справочнике Настройка электронного адреса, " + 
	"при настройке нужно установить флаг ""почта подсистемы""";
	
	// если основной электроный адрес отсуствует или их больше 2-х то генерируем ошибку в лог ошибок
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	RJM_НастройкаЭлектронногоАдреса.Ссылка
	|ИЗ
	|	Справочник.RJM_НастройкаЭлектронногоАдресаСервера КАК RJM_НастройкаЭлектронногоАдреса
	|ГДЕ
	|	RJM_НастройкаЭлектронногоАдреса.ПочтаПодсистемы = &ПочтаПодсистемы";
	Запрос.УстановитьПараметр("ПочтаПодсистемы", Истина);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			СформироватьОшибкуПроверкиОсновногоЭлектронногоАдресаСервера(СобытиеОшибки, СообщениеОбОшибке);
			РезультатПроверки = Ложь;
		Иначе
			НаборЗаписей = РегистрыСведений.RJM_ЛогОшибок.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВебСервис.Установить(Справочники.RJM_ВебСервисы.ПустаяСсылка());
			НаборЗаписей.Отбор.СобытиеПроверки.Установить(СобытиеОшибки);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
	Иначе
		СформироватьОшибкуПроверкиОсновногоЭлектронногоАдресаСервера(СобытиеОшибки, СообщениеОбОшибке);
		РезультатПроверки = Ложь;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

Процедура СформироватьОшибкуПроверкиОсновногоЭлектронногоАдресаСервера(СобытиеОшибки, СообщениеОбОшибке)
	НовыйМенеджерЗаписи = РегистрыСведений.RJM_ЛогОшибок.СоздатьМенеджерЗаписи();	
	НовыйМенеджерЗаписи.ВебСервис = Справочники.RJM_ВебСервисы.ПустаяСсылка();
	НовыйМенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	НовыйМенеджерЗаписи.СобытиеПроверки = СобытиеОшибки;
	НовыйМенеджерЗаписи.ИнформацияОбОшибкеИлиОСостоянии = СообщениеОбОшибке;	
	НовыйМенеджерЗаписи.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеРегламентныхЗаданийВФоне
Функция ВыполнитьРегламентноеЗаданиеВручную(Знач Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыВыполнения = ПараметрыВыполненияРегламентногоЗадания();
	ПараметрыВыполнения.ПроцедураУжеВыполняется = Ложь;
	
	ПараметрыВыполнения.ЗапускВыполнен = Ложь;
	СвойстваПоследнегоФоновогоЗадания = ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
	
	Если СвойстваПоследнегоФоновогоЗадания <> Неопределено
	   И СвойстваПоследнегоФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		ПараметрыВыполнения.МоментЗапуска  = СвойстваПоследнегоФоновогоЗадания.Начало;
		Если ЗначениеЗаполнено(СвойстваПоследнегоФоновогоЗадания.Наименование) Тогда
			ПараметрыВыполнения.ПредставлениеФоновогоЗадания = СвойстваПоследнегоФоновогоЗадания.Наименование;
		Иначе
			ПараметрыВыполнения.ПредставлениеФоновогоЗадания = ПредставлениеРегламентногоЗадания(Задание);
		КонецЕсли;
	Иначе
		НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запуск вручную: %1'"), ПредставлениеРегламентногоЗадания(Задание));
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, Строка(Задание.УникальныйИдентификатор), НаименованиеФоновогоЗадания);
		ПараметрыВыполнения.ИдентификаторФоновогоЗадания = Строка(ФоновоеЗадание.УникальныйИдентификатор);
		ПараметрыВыполнения.МоментЗапуска = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФоновоеЗадание.УникальныйИдентификатор).Начало;
		ПараметрыВыполнения.ЗапускВыполнен = Истина;
	КонецЕсли;
	
	ПараметрыВыполнения.ПроцедураУжеВыполняется = НЕ ПараметрыВыполнения.ЗапускВыполнен;
	Возврат ПараметрыВыполнения;
	
КонецФункции	

Функция ПараметрыВыполненияРегламентногоЗадания() 
	
	Результат = Новый Структура;
	Результат.Вставить("МоментЗапуска");
	Результат.Вставить("ИдентификаторФоновогоЗадания");
	Результат.Вставить("ПредставлениеФоновогоЗадания");
	Результат.Вставить("ПроцедураУжеВыполняется");
	Результат.Вставить("ЗапускВыполнен");
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), Строка(РегламентноеЗадание.УникальныйИдентификатор), РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = ПолучитьТаблицуСвойствФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции

Функция ПредставлениеРегламентногоЗадания(Знач Задание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
		РегламентноеЗадание = Задание;
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Задание));
	КонецЕсли;
	
	Если РегламентноеЗадание <> Неопределено Тогда
		Представление = РегламентноеЗадание.Наименование;
		
		Если ПустаяСтрока(РегламентноеЗадание.Наименование) Тогда
			Представление = РегламентноеЗадание.Метаданные.Синоним;
			
			Если ПустаяСтрока(Представление) Тогда
				Представление = РегламентноеЗадание.Метаданные.Имя;
			КонецЕсли
		КонецЕсли;
	Иначе
		Представление = ТекстНеОпределено();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьТаблицуСвойствФоновыхЗаданий(Отбор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = ПустаяТаблицаСвойствФоновыхЗаданий();
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания") Тогда
		Отбор.Удалить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
		ПолучитьПоследнее = Истина;
	Иначе
		ПолучитьПоследнее = Ложь;
	КонецЕсли;
	
	РегламентноеЗадание = Неопределено;
	
	// Добавление истории фоновых заданий, полученных с сервера.
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
				Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			ТекущийОтбор = Новый Структура("Ключ", Отбор.ИдентификаторРегламентногоЗадания);
			ФоновыеЗаданияЗапущенныеВручную = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			Если РегламентноеЗадание <> Неопределено Тогда
				ПоследнееФоновоеЗадание = РегламентноеЗадание.ПоследнееЗадание;
			КонецЕсли;
			Если НЕ ПолучитьПоследнее ИЛИ ПоследнееФоновоеЗадание = Неопределено Тогда
				ТекущийОтбор = Новый Структура("РегламентноеЗадание", РегламентноеЗадание);
				АвтоматическиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			КонецЕсли;
			Если ПолучитьПоследнее Тогда
				Если ПоследнееФоновоеЗадание = Неопределено Тогда
					ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(АвтоматическиеФоновыеЗадания);
				КонецЕсли;
				
				ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(
					ФоновыеЗаданияЗапущенныеВручную, ПоследнееФоновоеЗадание);
				
				Если ПоследнееФоновоеЗадание <> Неопределено Тогда
					МассивФоновыхЗаданий = Новый Массив;
					МассивФоновыхЗаданий.Добавить(ПоследнееФоновоеЗадание);
					ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
				КонецЕсли;
				Возврат Таблица;
			КонецЕсли;
			ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗаданияЗапущенныеВручную, Таблица);
			ДобавитьСвойстваФоновыхЗаданий(АвтоматическиеФоновыеЗадания, Таблица);
		Иначе
			МассивФоновыхЗаданий = Новый Массив;
			ВсеИдентификаторыРегламентныхЗаданий = Новый Соответствие;
			Для каждого ТекущееЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
				ВсеИдентификаторыРегламентныхЗаданий.Вставить(
					Строка(ТекущееЗадание.УникальныйИдентификатор), Истина);
			КонецЦикла;
			ВсеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
			Для каждого ТекущееЗадание Из ВсеФоновыеЗадания Цикл
				Если ТекущееЗадание.РегламентноеЗадание = Неопределено
				   И ВсеИдентификаторыРегламентныхЗаданий[ТекущееЗадание.Ключ] = Неопределено Тогда
				
					МассивФоновыхЗаданий.Добавить(ТекущееЗадание);
				КонецЕсли;
			КонецЦикла;
			ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Отбор) Тогда
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
		Иначе
			Если Отбор.Свойство("Идентификатор") Тогда
				Отбор.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(Отбор.Идентификатор));
				Отбор.Удалить("Идентификатор");
			КонецЕсли;
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			Если Отбор.Свойство("УникальныйИдентификатор") Тогда
				Отбор.Вставить("Идентификатор", Строка(Отбор.УникальныйИдентификатор));
				Отбор.Удалить("УникальныйИдентификатор");
			КонецЕсли;
		КонецЕсли;
		ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		РегламентныеЗаданияДляОбработки = Новый Массив;
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			Если РегламентноеЗадание = Неопределено Тогда
				РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
					Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			КонецЕсли;
			Если РегламентноеЗадание <> Неопределено Тогда
				РегламентныеЗаданияДляОбработки.Добавить(РегламентноеЗадание);
			КонецЕсли;
		КонецЕсли;
	Иначе
		РегламентныеЗаданияДляОбработки = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	КонецЕсли;
	
	Таблица.Сортировать("Начало Убыв, Конец Убыв");
	
	// Отбор фоновых заданий.
	Если ЗначениеЗаполнено(Отбор) Тогда
		Начало    = Неопределено;
		Конец     = Неопределено;
		Состояние = Неопределено;
		Если Отбор.Свойство("Начало") Тогда
			Начало = ?(ЗначениеЗаполнено(Отбор.Начало), Отбор.Начало, Неопределено);
			Отбор.Удалить("Начало");
		КонецЕсли;
		Если Отбор.Свойство("Конец") Тогда
			Конец = ?(ЗначениеЗаполнено(Отбор.Конец), Отбор.Конец, Неопределено);
			Отбор.Удалить("Конец");
		КонецЕсли;
		Если Отбор.Свойство("Состояние") Тогда
			Если ТипЗнч(Отбор.Состояние) = Тип("Массив") Тогда
				Состояние = Отбор.Состояние;
				Отбор.Удалить("Состояние");
			КонецЕсли;
		КонецЕсли;
		
		Если Отбор.Количество() <> 0 Тогда
			Строки = Таблица.НайтиСтроки(Отбор);
		Иначе
			Строки = Таблица;
		КонецЕсли;
		// Выполнение дополнительного отбора по периоду и состоянию (если отбор определен).
		НомерЭлемента = Строки.Количество() - 1;
		Пока НомерЭлемента >= 0 Цикл
			Если Начало    <> Неопределено И Начало > Строки[НомерЭлемента].Начало
				Или Конец     <> Неопределено И Конец  < ?(ЗначениеЗаполнено(Строки[НомерЭлемента].Конец), Строки[НомерЭлемента].Конец, ТекущаяДатаСеанса())
				Или Состояние <> Неопределено И Состояние.Найти(Строки[НомерЭлемента].Состояние) = Неопределено Тогда
				Строки.Удалить(НомерЭлемента);
			КонецЕсли;
			НомерЭлемента = НомерЭлемента - 1;
		КонецЦикла;
		// Удаление лишних строк из таблицы.
		Если ТипЗнч(Строки) = Тип("Массив") Тогда
			НомерСтроки = Таблица.Количество() - 1;
			Пока НомерСтроки >= 0 Цикл
				Если Строки.Найти(Таблица[НомерСтроки]) = Неопределено Тогда
					Таблица.Удалить(Таблица[НомерСтроки]);
				КонецЕсли;
				НомерСтроки = НомерСтроки - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Процедура ДобавитьСвойстваФоновыхЗаданий(Знач МассивФоновыхЗаданий, Знач ТаблицаСвойствФоновыхЗаданий)
	
	Индекс = МассивФоновыхЗаданий.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ФоновоеЗадание = МассивФоновыхЗаданий[Индекс];
		Строка = ТаблицаСвойствФоновыхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ФоновоеЗадание);
		Строка.Идентификатор = ФоновоеЗадание.УникальныйИдентификатор;
		РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
		
		Если РегламентноеЗадание = Неопределено
		   И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
		КонецЕсли;
		Строка.ИдентификаторРегламентногоЗадания = ?(
			РегламентноеЗадание = Неопределено,
			"",
			РегламентноеЗадание.УникальныйИдентификатор);
		
		Строка.ОписаниеИнформацииОбОшибке = ?(
			ФоновоеЗадание.ИнформацияОбОшибке = Неопределено,
			"",
			ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстНеОпределено() Экспорт
	
	Возврат НСтр("ru = '<не определено>'");
	
КонецФункции

Функция ПустаяТаблицаСвойствФоновыхЗаданий()
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Идентификатор",                     Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Наименование",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Ключ",                              Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Начало",                            Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("Конец",                             Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторРегламентногоЗадания", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Состояние",                         Новый ОписаниеТипов("СостояниеФоновогоЗадания"));
	НоваяТаблица.Колонки.Добавить("ИмяМетода",                         Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Расположение",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ОписаниеИнформацииОбОшибке",        Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ПопыткаЗапуска",                    Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("СообщенияПользователю",             Новый ОписаниеТипов("Массив"));
	НоваяТаблица.Колонки.Добавить("НомерСеанса",                       Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("НачалоСеанса",                      Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Индексы.Добавить("Идентификатор, Начало");
	
	Возврат НоваяТаблица;
	
КонецФункции

Функция ПоследнееФоновоеЗаданиеВМассиве(МассивФоновыхЗаданий, ПоследнееФоновоеЗадание = Неопределено)
	
	Для каждого ТекущееФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПоследнееФоновоеЗадание.Конец) Тогда
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			 ИЛИ ПоследнееФоновоеЗадание.Конец < ТекущееФоновоеЗадание.Конец Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			   И ПоследнееФоновоеЗадание.Начало < ТекущееФоновоеЗадание.Начало Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоследнееФоновоеЗадание;
	
КонецФункции

#КонецОбласти
